//==============================================================================
//						Digital Input Output 관련 함수들
//==============================================================================

#include <mega128.h>
#include "Main.h"
#include "Macro.h"
#include "DIO.h"


//------------------------------------------------------------------------------
// 버튼 읽기
//------------------------------------------------------------------------------
void ReadButton(void)
{
	int		i;
	BYTE	lbtmp;

	lbtmp = PINA & 0x03;
	if((lbtmp!=0x03)){
		if(++gBtnCnt>100){   // 눌러서 0.1초 이상 유지되면 입력 인정
			if(lbtmp==0x02){	// PF1 버튼 눌러졌으면 샘플 모션 실행
				SampleMotion1();
			}
		}
	}
	else{
	    gBtnCnt=0;
    }
} 


//------------------------------------------------------------------------------
// Io 업데이트 처리
//------------------------------------------------------------------------------
void IoUpdate(void)
{
	// 모드 표시 LED 처리
	if(F_DIRECT_C_EN){		// 직접 제어 모드이면
		PF1_LED1_ON;
		PF1_LED2_OFF;
		PF2_LED_ON;
		return;
	}
}
